# FbxLightEmitRectangleLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightEmitRectangleLength Property
ParameterTypeId Class See Also
---
"Emit from Rectangle Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightEmitRectangleLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightEmitRectangleLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightEmitRectangleLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace